<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"1cc089f9649a0432883a662b7f319b2cf57dac8edddfb060c29e4ec7f9f4ffbf","plan_job_ref":"Job Terraform plan #48 at https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8224062895","plan_out_hash":"db4071657bef9abef858dd5347dbd04b8f233996b820e0eba677aca0ff2cae37","plan_hash":"ca9777ac7db0ffda0090c2dadfa46a7d7f3822211fd55c6c115f2fff1e7ad0e1","plan_text_format":"diff","version":"1.42.0","closed":true} -->
Terraform plan in __terraform__<details open><summary>With variables</summary>

```hcl
api_registry        = "crpoec718rf5704ehe0c"
api_repository      = "api"
deployer_access_key = (sensitive value)
deployer_secret_key = (sensitive value)
folder_id           = "b1gs3v5tpo5eo8em8ph4"
github_sha          = "943ffaf0117bd88229ff8497a76b4ea42363a76e"
```
</details>
<details>
<summary>Plan: 2 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # yandex_function.receive-video-handler will be updated in-place
!~  resource "yandex_function" "receive-video-handler" {
        id                 = "d4ef136o48bqjg3sv4q7"
        name               = "receive-video-handler"
        tags               = []
!~      user_hash          = "60a7b810cfa9866460b12013671bcb372b7caafa9a003b0483d97c6d74e3793b" -> "bf1d55a9a324fb0288fb879417e8f61f2b6800f109d41bd95404eb1c30a9349b"
#        (11 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # yandex_serverless_container.test-container will be updated in-place
!~  resource "yandex_serverless_container" "test-container" {
        id                 = "bbanib3f62itfcacbg10"
        name               = "api"
#        (11 unchanged attributes hidden)

!~      image {
!~          url         = "cr.yandex/crpoec718rf5704ehe0c/api:9fae9568ab54a8e97c5994142097d2a554d70025" -> "cr.yandex/crpoec718rf5704ehe0c/api:943ffaf0117bd88229ff8497a76b4ea42363a76e"
#            (4 unchanged attributes hidden)
        }

#        (1 unchanged block hidden)
    }

  # yandex_ydb_database_serverless.main-db will be created
+   resource "yandex_ydb_database_serverless" "main-db" {
+       created_at            = (known after apply)
+       database_path         = (known after apply)
+       deletion_protection   = false
+       document_api_endpoint = (known after apply)
+       folder_id             = (known after apply)
+       id                    = (known after apply)
+       location_id           = (known after apply)
+       name                  = "main-db"
+       sleep_after           = 0
+       status                = (known after apply)
+       tls_enabled           = (known after apply)
+       ydb_api_endpoint      = (known after apply)
+       ydb_full_endpoint     = (known after apply)

+       serverless_database {
+           enable_throttling_rcu_limit = false
+           provisioned_rcu_limit       = 10
+           storage_size_limit          = 50
+           throttling_rcu_limit        = 0
        }
    }

  # yandex_ydb_table.movie-recognition will be created
+   resource "yandex_ydb_table" "movie-recognition" {
+       attributes             = (known after apply)
+       connection_string      = (known after apply)
+       id                     = (known after apply)
+       key_bloom_filter       = (known after apply)
+       path                   = "movie-recognition"
+       primary_key            = [
+           "id",
        ]
+       read_replicas_settings = (known after apply)

+       column {
+           family   = (known after apply)
+           name     = "created_at"
+           not_null = true
+           type     = "Datetime"
        }
+       column {
+           family   = (known after apply)
+           name     = "id"
+           not_null = true
+           type     = "Int32"
        }
+       column {
+           family   = (known after apply)
+           name     = "status"
+           not_null = true
+           type     = "Utf8"
        }
+       column {
+           family   = (known after apply)
+           name     = "video_url"
+           not_null = true
+           type     = "Utf8"
        }
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Terraform apply #30](https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8224074197)